---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsPipeSizeMaximum
source: html/667d4ac8-6cc0-f273-03a9-d19ea30ce2de.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsPipeSizeMaximum Property

"Maximum Size"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsPipeSizeMaximum { get; }
```